app/controllers/authors/accounts_controller.rb

    def update_info
      if current_author.update(author_info_params)
---
UPDATE "authors" SET "bio" = $1, "updated_at" = $2 WHERE "authors"."id" = $3