app/controllers/authors/posts_controller.rb

INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @post = current_author.posts.new(post_params)

      respond_to do |format|
        if @post.save

UPDATE "posts" SET "banner_image_url" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["banner_image_url", "https://images.pexels.com/photos/285463/pexels-photo-285463.jpeg?w=1260&h=750&auto=compress&cs=tinysrgb"], ["updated_at", "2018-01-04 03:26:51.629553"], ["id", 2]]
---
    def update
      respond_to do |format|
        if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC  [["author_id", 1]]
---
      def set_post
        @post = current_author.posts.friendly.find(params[:id])